{
  "name":"Brandon Barker",
  "title":"Software Developer",
  "copyright":"2016 Copyright of Brandon Barker",
  "introduction":{
    "prelabel":"Hi My Name is Brandon!",
    "label":"I am a...",
    "items":[
      "Inventor",
      "Nerd",
      "Programmer",
      "Tinkerer"
    ]
  },
  "biography":{
    "label":"Summary",
    "photo":"images/bbarker.jpeg",
    "description":"I am a proud tinkerer, inventor, nerd, student, and full-time software developer. From <a href='#prostheticarm'>prosthetic arms</a>, and <a href='#boostogy'>educational learning platforms</a>, to <a href='#ioculist'>eye exams</a>, it has been my goal to innovate for the future and create projects that will change the world. Learning is important and can be fun, which is why every year I put myself through circumstances that I would not normally be in, pushing the boundaries of my knowledge."
  },
  "address":{
    "city":"Downingtown",
    "state":"Pennsylvania",
    "country":"United States"
  },
  "contact":{
    "label":"Contact",
    "items":[
      {
        "title":"phone",
        "icon":"fa-phone-square",
        "value":"+1 (215) 530-1609",
        "href":"tel:2155301609",
        "blank":false
      },
      {
        "title":"email",
        "icon":"fa-envelope-square",
        "value":"brandon@brandonbarker.me",
        "href":"mailto:brandon@brandonbarker.me",
        "blank":false
      },
      {
        "title":"twitter",
        "icon":"fa-twitter-square",
        "value":"@projectbarks",
        "href":"https://twitter.com/ProjectBarks",
        "blank":true
      },
      {
        "title":"skype",
        "icon":"fa-skype",
        "value":"bbark9.barker9",
        "href":"skype:bbark9.barker9",
        "blank":false
      },
      {
        "title":"github",
        "icon":"fa-github-square",
        "value":"ProjectBarks",
        "href":"https://github.com/ProjectBarks",
        "blank":true
      }
    ]
  },
  "job":{
    "label":"Career Summary",
    "tag":"career",
    "highlights":[
      {
        "title":"Work Experience",
        "items":[
          {
            "title":"Software Engineer",
            "organization":"Airphrame, Inc.",
            "link":"http://www.airphrame.com/",
            "location":"San Francisco, CA",
            "start":"July 2015",
            "end":"Present",
            "description":"An unmanned vehicle technology startup developing an aerial imaging and mapping service for commercial markets. Worked on the mapping platform's aerial avoidance system and integrated video based capture. Helped optimize the server platform through micro services."
          },
          {
            "title":"Software Engineer",
            "organization":"Cloudmine, Inc.",
            "link":"https://cloudmineinc.com/",
            "location":"Philadelphia, PA",
            "start":"July 2014",
            "end":"Feb. 2015",
            "description":"A HIPAA compliant data enablement platform for healthcare, empowering users to operationalize their most sensitive data. Worked on the Android API platform to ensure continuity and scalability. Created a CI system generating docker environments for easy automated staging and production testing."
          }
        ]
      },
      {
        "title":"Activities and Events",
        "items":[
          {
            "title":"Head of Technology",
            "organization":"Mighty Moose Ice Hockey, Inc.",
            "link":"http://mightymooseicehockey.com",
            "location":"Philadelphia, PA",
            "start":"February 2016",
            "end":"Present",
            "description":"Volunteered to help a local non-profit with their website and technical needs. Migrated them to a different web platform and currently developing their website. Work with the non-profit for about three hours every week."
          },
          {
            "title":"Code for Good Competition",
            "organization":"JPMorgan Chase & Co.",
            "location":"New York, NY",
            "start":"October 2015",
            "description":"Given a list of companies you must create an application to solve a problem that are current. Created an application to motivate underprivileged kids into working to get to college through the gamification of scholarships. Although the Team was proud of the product the app did not place."
          },
          {
            "title":"Founder and Head Organizer",
            "organization":"STEMHacks Hackathon",
            "location":"PA",
            "start":"June 2014",
            "end":"Present",
            "description":"One of a few high school hackathons in the Pennsylvania. The event strives to get high schoolers interested and involved in technology, having a influence of over 400+ students around the country! By providing a fun outlet for students to invent STEMHacks helped to create the future of innovators."
          },
          {
            "title":"2nd Place",
            "organization":"HackBCA Hackathon",
            "location":"Hackensack, NJ",
            "start":"April 2014",
            "description":"Competed with over 500 students to invent an application in the 24 hour deadline. Created iOculist, an app to test eyesight acuity and ended up winning second place. The event would then inspire STEMHacks after recognizing the potential of these genres of events."
          },
          {
            "title":"2nd Place",
            "organization":"Delaware Valley Science Convention",
            "location":"Oaks, PA",
            "start":"October 2011",
            "description":"An invitation only competition for innovative science related projects. Developed a mind-controlled prosthetic arm. Won second place, received an award from the Navy, the Army, received an excellence in engineering award, and invited to Broadcom MASTERS."
          },
          {
            "title":"Head Software Developer",
            "organization":"Out of the Box Robotics",
            "location":"Coatesville, PA",
            "start":"Sept. 2011",
            "end":"Present",
            "description":"A competitive team in the FIRST league winning up to the East Regional Competition. Develop utility applications to assist in the usage or construction of the robot. Mentored other teams in programming and software design. Wrote the software to control the autonomous and drive portion of the robot."
          }
        ]
      }
    ]
  },
  "skill":{
    "label":"Software Background",
    "tag":"languages",
    "language":{
      "label":"Languages",
      "items":[
        {
          "label":"Java",
          "level":100
        },
        {
          "label":"Python",
          "level":100
        },
        {
          "label":"JavaScript",
          "level":100
        },
        {
          "label":"HTML / CSS / LESS",
          "level":100
        },
        {
          "label":"CoffeeScript",
          "level":100
        },
        {
          "label":"Bash",
          "level":100
        },
        {
          "label":"Processing",
          "level":100
        },
        {
          "label":"TypeScript",
          "level":90
        },
        {
          "label":"AppleScript",
          "level":75
        },
        {
          "label":"Lua",
          "level":70
        },
        {
          "label":"Go",
          "level":60
        },
        {
          "label":"C++",
          "level":40
        },
        {
          "label":"Groovy",
          "level":30
        },
        {
          "label":"C#",
          "level":30
        }
      ]
    },
    "framework":{
      "label":"Tools and Frameworks",
      "items":[
        "Node.JS",
        "Gulp",
        "Grunt",
        "Makefile",
        "ReactJS",
        "JQuery",
        "Spring",
        "Google Web Toolkit",
        "Maven",
        "Gradle ",
        "SBT",
        "SQL",
        "Postgres",
        "Netty",
        "Jackson/Json",
        "JDBI",
        "Google App Engine",
        "Amazon Web Services",
        "Heroku",
        "Django",
        "Docker",
        "web2py",
        "Flask"
      ]
    }
  },
  "project":{
    "label":"Projects",
    "tag":"projects",
    "items":[
      {
        "id":"fancyprox",
        "link":"http://fancyprox.appspot.com/",
        "title":"Fancy Prox",
        "image":"images/fancyprox.jpeg",
        "tags":[
          "Google App Engine",
          "Python",
          "Proxy",
          "WebApp2",
          "Cache"
        ],
        "short_description":"Simple and Available Web Proxy",
        "description":"FancyProx is an easy to deploy proxy utilizing Google App Engine as a host. FancyProx is a more optimized proxy in comparison to others because it caches websites as it goes allowing for quicker retrieval on a secondary visit. Furthermore, because it is on google app engine it allows for users to create their own personal proxy easily."
      },
      {
        "id":"mytransfer",
        "title":"MyTransfer",
        "image":"images/mytransfer.jpeg",
        "tags":[
          "Chrome Extension",
          "Python",
          "Web Scraping",
          "Neural Network"
        ],
        "short_description":"Simple and Available Web Proxy",
        "description":"MyTransfer integrates Learning Systems, Schoology, Edmodo, and Blackboard, and the homework management system, MyHomework, together. MyTransfer reverse engineers the MyHomework system so that you do not need to worry about adding assignments anymore. Best of all it copies all relevant information like date, time, description and more!"
      },
      {
        "id":"stemclasses",
        "link":"https://github.com/ProjectBarks/STEMClasses",
        "title":"STEM Classes",
        "image":"images/stemclasses.jpeg",
        "tags":[
          "Native Code",
          "Java",
          "Injection",
          "Reflection",
          "Website Scraping"
        ],
        "short_description":"Your School Schedule in a Convenient Place",
        "description":"Deployed to over 800 students. This tool allows a user to view the amount of time remaining in a class period and the schedule format that corresponds with the day. This was a difficult project to make because it requires native code injection to enable notifications."
      },
      {
        "id":"ioculist",
        "link":"https://github.com/springle/iOculist",
        "title":"iOculist",
        "image":"images/ioculist.jpeg",
        "tags":[
          "iOS",
          "Android",
          "Voice Recognition",
          "Visual Recognition",
          "Simplistic UI"
        ],
        "short_description":"An Eye Test More Convenient than the Doctor",
        "description":"A mobile application that tracks the distance between the user's eyes as he backs away from his phone. It uses Snellen's formulas and voice recognition to generate a highly accurate eye exam on your iOS or Android device. This test checks for visual acuity, color blindness, and astigmatism."
      },
      {
        "id":"boostogy",
        "":"https://chrome.google.com/webstore/detail/boostogy/kggdhabjkonkgnmmcnbjeiifllidfgde?utm_source=chrome-ntp-icon",
        "title":"Boostogy",
        "tags":[
          "Javascript",
          "Web Scraping",
          "CSS",
          "HTML Templates",
          "Chrome Extension"
        ],
        "image":"images/boostogy.jpeg",
        "short_description":"Updates schoology to be more user friendly and intuitive!",
        "description":"Enhances Schoology with Tons of Features: Circle icons opposed to squares, Hiding classes, Rearrange classes, A stagnate sidebar and top bar, Infinite Scrolling, Removal of School Themes, Rename Classes, Popup Scroll Lock, Boostogy Settings, Quiz Highlighter and Tools, and Many minor tweaks."
      },
      {
        "id":"wordiel",
        "link":"https://github.com/ProjectBarks/Wordiel",
        "title":"Wordiel",
        "tags":[
          "Java",
          "Math 2D",
          "QuadTree",
          "Word Cloud"
        ],
        "image":"images/wordiel.jpeg",
        "short_description":"Advanced Collision Based Image Generation",
        "description":"Inspired by Wordle I attempted to make an Open Source version of API that would allow developers to easily generate word clouds. This was a fun project to make because it required an extensive math knowledge and pushed my technical ability to the next level implementing and learning algorithms to make my tool more efficient."
      },
      {
        "id":"middlemeets",
        "link":"https://bitbucket.org/ProjectBarks/middlemeets",
        "title":"Middle Meets",
        "tags":[
          "Android",
          "Material Design",
          "RESTful",
          "Yelp",
          "Google Places"
        ],
        "image":"images/middlemeets.jpeg",
        "short_description":"Spend Less Time Traveling and More Time Having Fun",
        "description":"Middle Meets is an Android application that relies on a Java RESTful server to provide it with its necessary map data. The application allows friends and acquaintances to easily meet at a center-point based off a list of locations. I enjoyed making this project because I saw a real need in the app market."
      },
      {
        "id":"stemhacks",
        "link":"https://github.com/ProjectBarks/STEMHacks-Admin",
        "title":"STEMHacks Admin",
        "tags":[
          "Python",
          "Google App Engine",
          "jQuery",
          "Material Design",
          "Bootstrap",
          "RESTful"
        ],
        "image":"images/stemhacks.jpeg",
        "short_description":"Planning Hackathons In One Place",
        "description":"STEMHacks Admin is an elegantly coded dashboard the centralizes my teams functions. I created STEMHacks as a basic automatic emailer for our sponsors but the project slowly snowballed into an entire dashboard with user, chat, broadcasting, support with many other tools. STEMHacks encompasses a lot of languages and frameworks increasing its complexity while increasing the team's productivity."
      },
      {
        "id":"ftcscouter",
        "link":"https://github.com/ProjectBarks/OOTBScouter",
        "title":"FTC Scouter",
        "tags":[
          "Android",
          " Material Design",
          " Database Sync",
          " Serialization"
        ],
        "image":"images/ftcscouter.jpeg",
        "short_description":"Score FTC Match and Analyze Match Data",
        "description":"FTC Scouter is a Material Design Android application focused in collecting match data and analyzing it. The data is serialized in JSON and then converted into a mySQL database where Tableau visualizes the data. This application was fun to build because it required support for a large squee of devices and required a lot of libraries to simulate the Material Design look."
      },
      {
        "id":"beatsync",
        "link":"https://github.com/beatsync",
        "title":"Beatsync",
        "tags":[
          "NodeJS",
          " Javascript",
          " jQuery",
          " Python",
          " SoundCloud",
          "Web Protocol"
        ],
        "image":"images/beatsync.jpeg",
        "short_description":"Seamless Audio Syncing Over the Web",
        "description":"After getting irritated when trying to listen to a song with my friend I decided to make BeatSync. BeatSync allows the user to create a playlist using their favorite streaming service and have the audio seamlessly synced between multiple devices. I enjoyed making this project because I ended up having to write my own web protocol that would allow the music to sync with no auditory difference."
      },
      {
        "id":"laugher",
        "link":"https://github.com/ProjectBarks/TheLaugher",
        "title":"The Laugher",
        "tags":[
          "Android",
          "Material Design",
          " RESTful",
          "Website Bot",
          " Google App Engine"
        ],
        "image":"images/laugher.jpeg",
        "short_description":"A Simple App To Tell Jokes",
        "description":"Comprised of a app engine host and an app, The Laugher, allows users to create and share jokes. This was a fun project to make not because of the sheer amount of funny jokes I saw, but the complexity of writing a bot that could scrape websites for jokes and classify them."
      },
      {
        "id":"infinitycache",
        "link":"https://github.com/ProjectBarks/infinity-cache",
        "title":"Infinity Cache",
        "tags":[
          "Cache",
          "Serialization",
          "SQL",
          "Efficiency"
        ],
        "image":"images/infinitycache.jpeg",
        "short_description":"The Simplest Static Storage Available",
        "description":"EasyCache is a simplistic yet well documented caching library focused towards Android in making the retrieval and serialization of objects for short term storage simplistic. Using a combination of annotations and a strong class structure EasyCache makes it efficient to quickly retrieve and store objects for later."
      },
      {
        "id":"convoanalyzer",
        "link":"https://github.com/ProjectBarks/PersonalityEvaluation",
        "title":"Conversation Analyzer",
        "tags":[
          "Google App Engine",
          "Python",
          "Natural Language Processing",
          "Node",
          "D3"
        ],
        "image":"images/messenger.jpeg",
        "short_description":"Analyze Your Conversations through Natural Language Processing",
        "description":"Using Natural Language Processing and data management techniques FCE allows for a user to see the subjects brought up in a Facebook conversation and whether that conversation was a negative or positive experience. Using libraries such as D3 and NLTK the application makes it easy to display conversation metrics and information. I thoroughly enjoyed making this because it was something I hadn't experimented with before"
      },
      {
        "id":"screenshot",
        "link":"https://getbitbar.com/plugins/System/screenshot.1d.py",
        "title":"BitBar Screenshot",
        "tags": ["applescript", "shell", "bitbar", "python"],
        "image":"images/bitbar.jpeg",
        "short_description":"Quick And Simple Way To Take Screenshots",
        "description": "Built ontop of BitBar, a simple dock framework, the tool allows for easy screenshots. The app utilizes AppleScript and shell to activate the machines screen capture tool and then redirects the image to where the user wants."
      },
      {
        "id":"dynapp",
        "link":"https://github.com/dynapp",
        "title":"Dynapp",
        "tags": ["Maven", "Dynamic Loading", "Android", "Custom Compilier", "Java"],
        "image":"images/dynapp.jpeg",
        "short_description":"Advanced Dynamic Packaging System For On The Fly App Modification",
        "description": "Using maven and a custom installer android apps can on the fly load code. The maven plugin uses the Android compiler to convert Java applications into native Android applications and copies to code into the phone's directory. The phone then uses a dynamic loader to easily inject the code into the program."
      },
      {
        "id":"prostheticarm",
        "title":"Mind Control Prosthetic Arm",
        "tags": ["EPOC", "C++", "EEG", "Neural Input", "Pattern Recognition", "Bluetooth", "Prosthetic"],
        "image":"images/prostheticarm.jpeg",
        "short_description":"Neurally Controlling A Prostetic Arm Through EEG's",
        "description": "Using the Emotive EPOC headset, a simple pattern recognition algorithm, and a Bluetooth interface a LEGO prosthetic arm can be controlled through thought. The headset takes in a raw EEG input then a  program made in C using the emotive developer library correlates certain thought patterns to a calibrated action. The application then activates the Lego Mindstorms through a Bluetooth connection. Currently, the hand only has two groups of movable fingers and the thumb; however, in newer versions of the prosthetic more hydraulic arms could be added. The project was recognized by multiple fairs and has a broad range of applications."
      }
    ]
  }
}